

const cardJson = [
/* --------------------------------------------------------------------------------- */

/* カードのjsonファイル */
'cards/WXDi-P12.json'

/* -------------------------------------------------------------------------- */];/*/*/

/* 初期設定 */

/* すべてのカードデータ */
let allCardsData = [];
/* フリック・タップしたカード */
let currentCard;
/* タッチ開始時のY座標初期値 */
let touchStartY = 0;
/* タッチ開始時間 */
let touchStartTime = 0;
/* LB検索ボタンのステータス */
let lifeBurstState = 0;

/* --------------------------------------------------------------------------------- */

document.addEventListener('DOMContentLoaded', () => {

/* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */

/* html要素の取得 */





/* -------------------------------------------------------------------------- */})/*/*/
